1D-3D-partitioned-pipe/Fluid2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    fixedWalls
    {
        type            patch;
        nFaces          800;
        startFace       29100;
    }
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       29900;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       30400;
    }
)

// ************************************************************************* //
